Repository: Behemutt/ZeCogsV3
Catalog: react_roles/locales/*.po
Languages: fr

source: Associate emojis on messages with roles to gain/lose roles when clicking on reactions RedBot V3 edition
fr: Associe des émojis à des messages avec des rôles pour gagner/perdre des rôles en cliquant sur des réactions Édition RedBot V3

source: Could not find message {msg_id} in {channel}.
fr: Le message {msg_id} dans {channel} est introuvable.

source: Could not find channel {channel_id}.
fr: Le salon {channel_id} est introuvable.

source: Could not find server with id {guild_id}.
fr: Le serveur avec id {guild_id} est introuvable.

source: Cached bindings: {bindings}
fr: Assignations en cache: {bindings}

source: Roles giving configuration
fr: Configuration pour assigner des rôles

source: Lists all reaction links in the current server
fr: Liste tous les liens de réactions sur le serveur actuel

source: Role Links
fr: Liens de rôle

source: There are no links in this server
fr: Il n’y a pas de liens dans ce serveur

source: Remove a link of messages by its name
fr: Supprime un lien de messages par son nom

source: :x: Could not find a link with that name in this server.
fr: :x: Ce nom de lien est introuvable sur ce serveur-ci.

source: :white_check_mark: The link has been removed from this server.
fr: :white_check_mark: Le lien a été supprimé du serveur.

source: Link messages together to allow only one role from those messages to be given to a member name is the name of the link; used to make removal easier linked_messages is an arbitrary number of channelid-messageid You can get those channelid-messageid pairs with a right click on messages and shift + click on "Copy ID" Users can only get one role out of all the reactions in the linked messages The bot will NOT remove the user's other reaction(s) when clicking within linked messages
fr: Lie des messages ensemble pour permettre seulement un rôle de ces messages à être assigné à un membre name est le nom du lien; utilisé pour l'identifier plus facilement linked_messages est un nombre de idsalon-idmessage arbitraire Vous pouvez obtenir ces paires idsalon-idmessage avec un clic droit sur un message puis avec un Maj + Clic sur "Copier l'identifiant" Les utilisateurs peuvent seulement obtenir un seul rôle à partir de toutes les réactions sur les messages liés Le bot ne vas PAS retirer les autres réactions de l'utilisateur lorsqu'il clique sur les réactions d'un message lié

source: You must specify at least one message to be linked.
fr: Vous devez spécifier au moins un message à lier.

source: The following channel-message pairs were invalid: {}
fr: Les paires de salon-message suivantes sont invalides: {}

source: The following channels weren't found: {}
fr: Les salons suivants sont introuvables: {}

source: The following messages weren't found: {}
fr: Les messages suivants sont introuvables: {}

source: :x: Failed to link reactions.
fr: :x: La liaison des réactions a échoué.

source: :x: That link name is already used in the current server. Remove it before assigning to it.
fr: :x: Ce nom de lien est déjà utilisé dans ce serveur-ci. Supprimez-le avant de réassigner au même nom.

source: :white_check_mark: Successfully linked the reactions.
fr: :white_check_mark: Les réactions ont été liées avec succès.

source: Add a role on a message `message_id` must be found in `channel` To get a message's id: Settings > Appearance > Developer mode then Right click a message > Copy ID `emoji` can either be a Unicode emoji or a server emote `role` must be found in the channel's server
fr: Ajoute un rôle sur un message `message_id` doit être trouvé dans `channel` Pour obtenir le id d'un message: Paramètres > Apparence > Mode développeur, puis Clic droit sur un message > Copier l'identifiant `emoji` peut être un émoji Unicode ou un émoji de serveur `role` doit être trouvé sur le serveur du salon « channel » donné

source: :x: Message not found.
fr: :x: Message introuvable.

source: :x: The channel must be in a server.
fr: :x: Le salon doit être dans un serveur.

source: :x: Role not found on the given channel's server.
fr: :x: Le rôle n'a pas été trouvé dans le serveur du salon donné.

source: :x: I don't have the permission to manage users' roles in the channel's server.
fr: :x: Je n'ai pas la permission de gérer les rôles dans le serveur du salon donné.

source: :x: I don't have the permission to add reactions in that channel.
fr: :x: Je n'ai pas la permission d'ajouter des réactions dans ce salon.

source: :x: The emoji is already bound on that message.
fr: :x: Cet emoji est déjà assigné à ce message.

source: :x: Emoji not found in any of my servers or in unicode emojis.
fr: :x: L'emoji est introuvable dans mes serveurs ou dans les emojis Unicode.

source: Testing permissions
fr: Essai des permissions

source: :x: I can't give that role! Maybe it's higher than my own highest role?
fr: :x: Je ne peux pas donner ce rôle! Il est peut-être plus haut que mon rôle le plus haut?

source: :white_check_mark: The role has been bound to {} on the message in {}.
fr: :white_check_mark: Le rôle a été assigné à {} sur le message dans {}.

source: Remove a role from a message `message_id` must be found in `channel` and be bound to `role` To get a message's id: Settings > Appearance > Developer mode then Right click a message > Copy ID
fr: Retire un rôle d'un message `message_id` doit être trouvé dans `channel` et être associé à `role` Pour obtenir le id d'un message: Paramètres > Apparence > Mode développeur, puis Clic droit sur un message > Copier l'identifiant

source: :x: The role is not bound to that message.
fr: :x: Le rôle n'est pas assigné à ce message.

source: :put_litter_in_its_place: Unbound the role on the message. :x: Message not found.
fr: :put_litter_in_its_place: Le rôle a été désassigné du message. :x: Message introuvable.

source: :put_litter_in_its_place: Unbound the role on the message. :x: Could not find the reaction of that message.
fr: :put_litter_in_its_place: Le rôle a été désassigné du message. :x: La réaction est introuvable sur ce message.

source: :put_litter_in_its_place: Unbound the role on the message. Removing linked reactions...
fr: :put_litter_in_its_place: Le rôle a été désassigné du message. Retrait des réactions liées...

source: :put_litter_in_its_place: Unbound the role on the message. Removed **{} / {}** reactions...
fr: :put_litter_in_its_place: Le rôle a été désassigné du message. **{} / {}** réactions ont été retirées...

source: :put_litter_in_its_place: Unbound the role on the message. Removed **{}** reactions.
fr: :put_litter_in_its_place: Le rôle a été désassigné du message. **{}** réactions ont été retirées.

source: Goes through all reactions of a message and gives the roles accordingly This does NOT work with messages in a link
fr: Passe au travers de toutes les réactions d'un message et assigne les rôles en conséquence Cette fonctionnalité n'est PAS disponible pour les messages avec des liens

source: :x: Cannot run a check on linked messages.
fr: :x: Il est impossible de vérifier des messages liés.

source: Requesting members...
fr: Requête des membres...

source: Initializing...
fr: Initialisation...

source: Checked {c} out of {r} reactions out of {t} emojis.
fr: {c} sur {r} réactions on été vérifiées sur {t} emojis.

source: :white_check_mark: Completed! Checked a total of {c} reactions. Gave a total of {g} roles.
fr: :white_check_mark: Terminé! Un total de {c} réactions on été vérifiées. {g} rôles ont été attribués.

source: Added a reaction
fr: Ajout d'une réaction

source: Removed a reaction
fr: Retrait d'une réaction
